BaseKinoteatr/src/Documents/ПродажаБилетов/ПродажаБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаБилетов</name>
  <attributes>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </attributes>
  <attributes>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСеанса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБронирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСеанса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кинозал</name>
    <type>
      <types>CatalogRef.Кинозалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБронирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКодПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СеансБронирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Билеты</name>
    <attributes>
      <name>РядМесто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BaseKinoteatr/src/InformationRegisters/ПроданныеБилеты/ПроданныеБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроданныеБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Бронирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронированиеВыкуплено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Зал</name>
    <type>
      <types>CatalogRef.Кинозалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BaseKinoteatr/src/Documents/ПродажаБилетов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ЕстьБилетыВТЧ = Ложь;
	
	Если ЭтоБронирование Тогда
		ДанныеСеанса = Кино.ПолучитьДанныеСеанса(ЭтотОбъект.СеансБронирования, ЭтотОбъект.Кинотеатр, ЭтотОбъект.Фильм);
	Иначе
		ДанныеСеанса = Кино.ПолучитьДанныеСеанса(ЭтотОбъект.Сеанс, ЭтотОбъект.Кинотеатр, ЭтотОбъект.Фильм);
	КонецЕсли; 
		
	Для каждого Стр Из ЭтотОбъект.Билеты Цикл
		
		Если Не ЗначениеЗаполнено(Стр.РядМесто) Тогда
			Продолжить;	
		КонецЕсли; 
		
		МассивРядМесто = СтрРазделить(Стр.РядМесто, "|");
		
		Набор = РегистрыСведений.ПроданныеБилеты.СоздатьНаборЗаписей();
		Набор.Отбор.Время.Установить(ДанныеСеанса.ВремяСеанса);
		Набор.Отбор.День.Установить(ЭтотОбъект.ДатаСеанса);
		Набор.Отбор.Период.Установить(ЭтотОбъект.ДатаСеанса);
		Набор.Отбор.Зал.Установить(ДанныеСеанса.Кинозал);
		Набор.Отбор.Кинотеатр.Установить(ДанныеСеанса.Кинотеатр);
		Набор.Отбор.Фильм.Установить(ДанныеСеанса.Фильм);
		Набор.Отбор.Место.Установить(МассивРядМесто[1]);
		Набор.Отбор.Ряд.Установить(МассивРядМесто[0]);
		
		Попытка
			Набор.Прочитать();	
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Запись.БронированиеВыкуплено = Истина;
			Попытка
				Набор.Записать();	
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сделать запись по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить();
				Продолжить;
			КонецПопытки;
			
			ЕстьБилетыВТЧ = Истина;
			
		Иначе	
			
			НоваяЗапись = РегистрыСведений.ПроданныеБилеты.СоздатьМенеджерЗаписи(); 
			
			НоваяЗапись.Бронирование = Ложь; 
			НоваяЗапись.Время = ДанныеСеанса.ВремяСеанса; 
			НоваяЗапись.День = ЭтотОбъект.ДатаСеанса;
			НоваяЗапись.Период = ЭтотОбъект.ДатаСеанса;
			НоваяЗапись.Зал = ДанныеСеанса.Кинозал;
			НоваяЗапись.Кинотеатр = ДанныеСеанса.Кинотеатр;
			НоваяЗапись.Место = МассивРядМесто[1];
			НоваяЗапись.Ряд = МассивРядМесто[0];
			НоваяЗапись.Фильм = ДанныеСеанса.Фильм;
			НоваяЗапись.Цена = Стр.Цена;
			НоваяЗапись.КодПодтверждения = ЭтотОбъект.УникальныйКодПродажи;
			
			Попытка
				НоваяЗапись.Записать();	
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сделать запись по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить(); 
				Продолжить;
			КонецПопытки; 
			
			ЕстьБилетыВТЧ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	Если Не ЕстьБилетыВТЧ Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В табличной части не выбрано ни одного места!";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры
